src/test/resources/mappings/calculator-add.json

{
  "request": {
    "method": "POST",
    "url": "/",
    "headers": {
      "User-Agent": {
        "equalTo": "Apache CXF 3.4.2"
      }
    },
    "bodyPatterns": [
      {
        "equalToXml": "<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><Add xmlns=\"http://tempuri.org/\"><intA>1</intA><intB>1</intB></Add></soap:Body></soap:Envelope>"
      }
    ]
  },
  "response": {
    "status": 200,
    "headers": {
      "Content-Type": "text/xml; charset=utf-8"
    },
    "body": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\"><soap:Body><AddResponse xmlns=\"http://tempuri.org/\"><AddResult>2</AddResult></AddResponse></soap:Body></soap:Envelope>"
  }
}
